src/БазоваяКонфигурация.ГенераторПользовательскихРолей/src/Catalogs/гпр_Роли/гпр_Роли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гпр_Роли</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИдентификаторРоли</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРолиВКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьПраваДляНовыхОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьПраваДляРеквизитовИТабличныхЧастейПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НезависимыеПраваПодчиненныхОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.гпр_СтатусыРоли</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПраваДоступа</name>
    <attributes>
      <name>ВидОбъекта</name>
      <type>
        <types>EnumRef.гпр_ВидыМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизита</name>
      <type>
        <types>EnumRef.гпр_ТипыРеквизитовОбъекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПравоДоступа</name>
      <type>
        <types>EnumRef.гпр_ПраваДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПраваДоступа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подсистемы</name>
    <attributes>
      <name>Подсистема</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОграниченияДоступаКДанным</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Поля</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОграничениеДоступа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШаблоныОграниченийДоступа</name>
    <attributes>
      <name>ИмяШаблона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонОграничения</name>
      <type>
        <types>CatalogRef.гпр_ШаблоныОграничений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/БазоваяКонфигурация.ГенераторПользовательскихРолей/src/CommonModules/гпр_ИспортЭкспортРолей/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2024, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет подготовку содержимого файла с ролями в формате json.
// 
// Параметры:
//  Роли - Массив из СправочникСсылка.гпр_Роли - Роли для выгрузки;
// 
// Возвращаемое значение:
//  Строка - Адрес во временном хранилище, с даннымим ролей в формате json
Функция СохранитьРоли(Роли) Экспорт
	
	Возврат ПоместитьВоВременноеХранилище(
		ДвоичныеДанные(
			СтрокаВФорматеJSON(
				ДанныеРолейКВыгрузке(
					Роли
				)
			)
		)
	);
	
КонецФункции

// Разбор файла с ролями в формате json и запись данных в базу.
// 
// Параметры:
//  АдресФайла - Строка - Адрес файла во временном хранилище
Процедура ЗагрузитьРоли(АдресФайла) Экспорт
	
	Файл = ПолучитьИзВременногоХранилища(АдресФайла); // ДвоичныеДанные
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.ОткрытьПоток(Файл.ОткрытьПотокДляЧтения());
	
	Результат = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON, Тип("ФиксированныйМассив"));
	ЧтениеJSON.Закрыть();
	
	Для Каждого Роль Из Результат Цикл // СправочникОбъект.гпр_Роли
		
		Роль.УстановитьНовыйКод();
		
		Если ТипЗнч(Роль) = Тип("СправочникОбъект.гпр_Роли") Тогда
			
			Роль.Родитель = Неопределено;
			
		КонецЕсли;
		
		Роль.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает имя роли для сохранения как имя файла.
//
// Параметры:
//  Роль -СправочникСсылка.гпр_Роли - выбранная роль.
//
// Возвращаемое значение:
//  Строка - имя роли в конфигураторе.
//
Функция ИмяРоли(Роль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Роль);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	гпр_Роли.ИмяРолиВКонфигурации
	|ИЗ
	|	Справочник.гпр_Роли КАК гпр_Роли
	|ГДЕ
	|	гпр_Роли.Ссылка = &Ссылка";
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса[0].ИмяРолиВКонфигурации;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеРолейКВыгрузке(Роли)
	
	ДанныеРолей = ДанныеРолей(Роли);
	
	Если ДанныеРолей.Пустой() Тогда
		
		ВызватьИсключение "Нет данных для экспорта";
		
	КонецЕсли;
	
	ВыборкаРолей = ДанныеРолей.Выбрать();
	Результат = Новый Массив();
	
	Пока ВыборкаРолей.Следующий() Цикл
		
		Результат.Добавить(ВыборкаРолей.Ссылка.ПолучитьОбъект());
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

Функция ДанныеРолей(Роли)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ШаблоныОграниченийДоступа.ШаблонОграничения КАК ШаблонОграничения
		|ПОМЕСТИТЬ Шаблоны
		|ИЗ
		|	Справочник.гпр_Роли.ШаблоныОграниченийДоступа КАК ШаблоныОграниченийДоступа
		|ГДЕ
		|	ШаблоныОграниченийДоступа.Ссылка В (&Роли)
		|СГРУППИРОВАТЬ ПО
		|	ШаблоныОграниченийДоступа.ШаблонОграничения
		|;
		|
		|ВЫБРАТЬ
		|	гпр_Роли.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.гпр_Роли КАК гпр_Роли
		|ГДЕ
		|	гпр_Роли.Ссылка В (&Роли)
		|	И НЕ гпр_Роли.ЭтоГруппа
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Шаблоны.ШаблонОграничения
		|ИЗ
		|	Шаблоны КАК Шаблоны"
	);
	Запрос.УстановитьПараметр("Роли", Роли);
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция СтрокаВФорматеJSON(КЗаписи)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, КЗаписи);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ДвоичныеДанные(Данные)
	
	Поток = Новый ПотокВПамяти();
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.УстановитьТекст(Данные);
	ТекстовыйДокумент.Записать(Поток);
	
	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
КонецФункции

#КонецОбласти
